Revit 2027 API
FillPattern.ExpandDots Method
 Corrects pattern dots to make them be drawn properly for Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExpandDots()
Public Function ExpandDots As Boolean
public:
bool ExpandDots()
member ExpandDots : unit -> bool
Return Value
Boolean
 Indicates whether any dots were in fact expanded.
See Also
Reference
FillPattern Class
Autodesk.Revit.DB Namespace